<a href="https://colab.research.google.com/github/cristian-rincon/escuela-datascience/blob/master/data_challenges/data_challenge_1_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

https://platzi.com/blog/data_challenge/

https://platzi.com/comunidad/platzidatachallenge-1/

In [3]:
from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

In [ ]:
!mkdir '/content/drive/My Drive/Colab Notebooks/Data Challenges/data/'

In [6]:
%cd /content/drive/My Drive/Colab Notebooks/Data Challenges/data

/content/drive/My Drive/Colab Notebooks/Data Challenges/data

In [ ]:
!pip install --upgrade --force-reinstall --no-deps kaggle

Collecting kaggle
  Downloading https://files.pythonhosted.org/packages/99/33/365c0d13f07a2a54744d027fe20b60dacdfdfb33bc04746db6ad0b79340b/kaggle-1.5.10.tar.gz (59kB)
     |████████████████████████████████| 61kB 4.0MB/s
Building wheels for collected packages: kaggle
  Building wheel for kaggle (setup.py) ... done
  Created wheel for kaggle: filename=kaggle-1.5.10-cp36-none-any.whl size=73269 sha256=1a6c1bbeceedb50ba062443cc7f0acd3b3a7c11f3ce4e274284f067ec593f874
  Stored in directory: /root/.cache/pip/wheels/3a/d1/7e/6ce09b72b770149802c653a02783821629146983ee5a360f10
Successfully built kaggle
Installing collected packages: kaggle
  Found existing installation: kaggle 1.5.10
    Uninstalling kaggle-1.5.10:
      Successfully uninstalled kaggle-1.5.10
Successfully installed kaggle-1.5.10

In [ ]:
from google.colab import files

In [ ]:
files.upload()

Saving kaggle.json to kaggle.json

{'kaggle.json': b'{"username":"cristianrincon","key":"f3dacaea734b9876ba71ad6432f8b811"}'}

In [ ]:
 ! mkdir ~/.kaggle

mkdir: cannot create directory ‘/root/.kaggle’: File exists

In [ ]:
! mv kaggle.json ~/.kaggle/

In [ ]:
!chmod 600 ~/.kaggle/kaggle.json

In [ ]:
%%sh 
kaggle competitions download -c titanic

Downloading titanic.zip to /content/drive/My Drive/Colab Notebooks/Data Challenges/data

100%|██████████| 34.1k/34.1k [00:00<00:00, 6.39MB/s]

In [ ]:
%%sh 
unzip titanic.zip

Archive:  titanic.zip
  inflating: gender_submission.csv
  inflating: test.csv
  inflating: train.csv

In [7]:
import pandas as pd
import numpy as np

## Lectura de datos desde CSV

In [8]:
gender_submission_data = pd.read_csv('gender_submission.csv')
test_data = pd.read_csv('test.csv')
train_data = pd.read_csv('train.csv')

In [9]:
gender_submission_data

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [10]:
gender_submission_data.shape

(418, 2)

In [11]:
test_data

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

In [12]:
test_data.shape

(418, 11)

In [13]:
train_data

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [14]:
train_data.shape

(891, 12)

## Unificando los datos

In [15]:
df = gender_submission_data.join(test_data.set_index('PassengerId'), on='PassengerId')
df = pd.concat([df, train_data])
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            892         0       3  ...   7.8292   NaN         Q
1            893         1       3  ...   7.0000   NaN         S
2            894         0       2  ...   9.6875   NaN         Q
3            895         0       3  ...   8.6625   NaN         S
4            896         1       3  ...  12.2875   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[1309 rows x 12 columns]

## Ordenando por PassengerId

In [28]:
df = df.sort_values(by="PassengerId", ascending=True)
# df = df.dropna()
df

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
0              1         0       3  ...    7.2500   NaN         S
1              2         1       1  ...   71.2833   C85         C
2              3         1       3  ...    7.9250   NaN         S
3              4         1       1  ...   53.1000  C123         S
4              5         0       3  ...    8.0500   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
413         1305         0       3  ...    8.0500   NaN         S
414         1306         1       1  ...  108.9000  C105         C
415         1307         0       3  ...    7.2500   NaN         S
416         1308         0       3  ...    8.0500   NaN         S
417         1309         0       3  ...   22.3583   NaN         C

[1309 rows x 12 columns]

## 1. ¿Cuántas personas iban en el titanic?

In [17]:
passengers = len(df.index)
passengers

1309

## 2. ¿Cuántos hombres y mujeres sobrevivieron?

### Conteo de sobrevivientes

In [18]:
np.sum(df["Survived"]==1)

494

### Mujeres

In [19]:
survived_female = df[(df["Survived"] == 1) & (df["Sex"] == "female")].count()
survived_female.Survived

385

### Hombres

In [20]:
survived_male = df[(df["Survived"] == 1) & (df["Sex"] == "male")].count()
survived_male.Survived

109

## 3. ¿Cuál fue el top 10 de edad que más sobrevieron y el top 10 de edad que no lo lograron?

In [29]:
# Los de mayor edad que sobrevivieron
df[df['Survived'] == 1].sort_values('Age', ascending=False).head(10)

     PassengerId  Survived  Pclass  ...      Fare    Cabin  Embarked
630          631         1       1  ...   30.0000      A23         S
96           988         1       1  ...   78.8500      C46         S
179         1071         1       1  ...   83.1583      E45         C
305         1197         1       1  ...   26.5500      B26         S
483          484         1       3  ...    9.5875      NaN         S
114         1006         1       1  ...  221.7792  C55 C57         S
275          276         1       1  ...   77.9583       D7         S
829          830         1       1  ...   80.0000      B28       NaN
570          571         1       2  ...   10.5000      NaN         S
213         1105         1       2  ...   26.0000      NaN         S

[10 rows x 12 columns]

In [30]:
# Los de mayor edad que no sobrevivieron
df[df['Survived'] == 0].sort_values('Age', ascending=False).head(10)

     PassengerId  Survived  Pclass  ...      Fare    Cabin  Embarked
851          852         0       3  ...    7.7750      NaN         S
96            97         0       1  ...   34.6542       A5         C
493          494         0       1  ...   49.5042      NaN         C
116          117         0       3  ...    7.7500      NaN         Q
672          673         0       2  ...   10.5000      NaN         S
745          746         0       1  ...   71.0000      B22         S
81           973         0       1  ...  221.7792  C55 C57         S
33            34         0       2  ...   10.5000      NaN         S
456          457         0       1  ...   26.5500      E38         S
280          281         0       3  ...    7.7500      NaN         Q

[10 rows x 12 columns]

## 4. ¿Cuántos cargos o títulos iban en el barco? Ejemplo: Capitanes, Mrs. Miss, etc. (Acá usarás expresiones regulares)

In [59]:
import re

In [68]:
test = "Braund, Mr. Owen Harris"

In [73]:
re.search(r'[A-Za-z]{1,}.\.', test).group()

'Mr.'

In [74]:
df['Titles'] = df['Name'].apply(lambda x: re.search(r'[A-Za-z]{1,}.\.', x).group())
df

     PassengerId  Survived  Pclass  ... Embarked CountNames   Titles
0              1         0       3  ...        S          1      Mr.
1              2         1       1  ...        C          1     Mrs.
2              3         1       3  ...        S          1    Miss.
3              4         1       1  ...        S          1     Mrs.
4              5         0       3  ...        S          1      Mr.
..           ...       ...     ...  ...      ...        ...      ...
413         1305         0       3  ...        S          1      Mr.
414         1306         1       1  ...        C          1    Dona.
415         1307         0       3  ...        S          1      Mr.
416         1308         0       3  ...        S          1      Mr.
417         1309         0       3  ...        C          1  Master.

[1309 rows x 14 columns]

In [79]:
df_titles = df[['Titles', 'CountNames']]

In [78]:
df_titles.groupby(by='Titles').count()

           CountNames
Titles
Capt.               1
Col.                4
Countess.           1
Don.                1
Dona.               1
Dr.                 8
Jonkheer.           1
Lady.               1
Major.              2
Master.            61
Miss.             260
Mlle.               2
Mme.                1
Mr.               757
Mrs.              197
Ms.                 2
Rev.                8
Sir.                1

## 5. ¿Cuánto es la sumatoria del valor de los tickets en USD (yep en USD)?

In [82]:
total_fare = df['Fare'].sum()
total_fare

43550.4869

In [83]:
lib_to_usd_conversion_in_1912 = 4.87
total_fare_in_usd = total_fare * lib_to_usd_conversion_in_1912
total_fare_in_usd

212090.87120300002

In [89]:
# This amount is in dollars in 1912, if we convert applying inflation rate it is equal to according to this https://www.in2013dollars.com/us/inflation/1912?amount=1.

inflation_rate = 26.83
total_fare_w_inflation_2021 = total_fare_in_usd * inflation_rate
int(total_fare_w_inflation_2021)

5690398